package org.example.task1;

public class Test {
    public static void main(String[] args) {
        //Завдання 1:
        //При старті додатку запускаються три потоки. Перший потік заповнює масив випадковими числами. Два
        //інших очікують заповнення. Коли масив заповнений, два інших потоки запускаються. Перший потік
        //знаходить суму елементів масиву, другий потік середнє арифметичне значення в масиві. Отриманий
        //масив, сума і середнє арифметичне значення повертаються в метод main, де повинні бути відображені.
        ArraySumAverageCalculation.getMenu();
    }
}
